nxp-mcuxpresso/mcux-soc-svd/MCXA133/MCXA133.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>FMU0TEST</name>
      <description>FlashTest</description>
      <groupName>MSF1_B_test</groupName>
      <baseAddress>0x40096000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FSTAT</name>
          <description>Flash Status Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAIL</name>
              <description>Command Fail Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz27</name>
                  <description>Error not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz28</name>
                  <description>Error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDABT</name>
              <description>Command Abort Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz25</name>
                  <description>No command abort detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz26</name>
                  <description>Command abort detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVIOL</name>
              <description>Command Protection Violation Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz23</name>
                  <description>No protection violation detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz24</name>
                  <description>Protection violation detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCERR</name>
              <description>Command Access Error Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz21</name>
                  <description>No access error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz22</name>
                  <description>Access error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWSABT</name>
              <description>Command Write Sequence Abort Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz19</name>
                  <description>Command write sequence not aborted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz20</name>
                  <description>Command write sequence aborted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCIF</name>
              <description>Command Complete Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz17</name>
                  <description>Flash command or initialization in progress</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz18</name>
                  <description>Flash command or initialization has completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDPRT</name>
              <description>Command Protection Level</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz13</name>
                  <description>Secure, normal access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz14</name>
                  <description>Secure, privileged access</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz15</name>
                  <description>Nonsecure, normal access</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz16</name>
                  <description>Nonsecure, privileged access</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDP</name>
              <description>Command Protection Status Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz11</name>
                  <description>Command protection level and domain ID are stale</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz12</name>
                  <description>Command protection level (CMDPRT) and domain ID (CMDDID) are set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDDID</name>
              <description>Command Domain ID</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFDIF</name>
              <description>Double Bit Fault Detect Interrupt Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz9</name>
                  <description>Double bit fault not detected during a valid flash read access from the FMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz10</name>
                  <description>Double bit fault detected (or FCTRL[FDFD] is set) during a valid flash read access from the FMC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SALV_USED</name>
              <description>Salvage Used for Erase operation</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz7</name>
                  <description>Salvage not used during the last operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz8</name>
                  <description>Salvage used during the last erase operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEWEN</name>
              <description>Program-Erase Write Enable Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz3</name>
                  <description>Writes are not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz4</name>
                  <description>Writes are enabled for one flash or IFR phrase (phrase programming, sector erase)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz5</name>
                  <description>Writes are enabled for one flash or IFR page (page programming)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERDY</name>
              <description>Program/Erase Ready Control/Status Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz1</name>
                  <description>Program or sector erase command operation is not stalled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz2</name>
                  <description>Program or sector erase command operation is stalled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCNFG</name>
          <description>Flash Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFE000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCIE</name>
              <description>Command Complete Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz37</name>
                  <description>Command complete interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz38</name>
                  <description>Command complete interrupt enabled. An interrupt request is generated whenever the FSTAT[CCIF] flag is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERSREQ</name>
              <description>Mass Erase (Erase All) Request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz35</name>
                  <description>No request or request complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz36</name>
                  <description>Request to run the Mass Erase operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFDIE</name>
              <description>Double Bit Fault Detect Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz33</name>
                  <description>Double bit fault detect interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz34</name>
                  <description>Double bit fault detect interrupt enabled; an interrupt request is generated whenever the FSTAT[DFDIF] flag is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERSIEN0</name>
              <description>Erase IFR Sector Enable - Block 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz31</name>
                  <description>Block 0 IFR Sector X is protected from erase by ERSSCR command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz32</name>
                  <description>Block 0 IFR Sector X is not protected from erase by ERSSCR command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERSIEN1</name>
              <description>Erase IFR Sector Enable - Block 1 (for dual block configs)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz29</name>
                  <description>Block 1 IFR Sector X is protected from erase by ERSSCR command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz30</name>
                  <description>Block 1 IFR Sector X is not protected from erase by ERSSCR command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTRL</name>
          <description>Flash Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RWSC</name>
              <description>Read Wait-State Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz45</name>
                  <description>no additional wait-states are added (single cycle access)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz46</name>
                  <description>1 additional wait-state is added</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz47</name>
                  <description>2 additional wait-states are added</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz48</name>
                  <description>3 additional wait-states are added</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz49</name>
                  <description>4 additional wait-states are added</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz50</name>
                  <description>5 additional wait-states are added</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz51</name>
                  <description>6 additional wait-states are added</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz52</name>
                  <description>7 additional wait-states are added</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz53</name>
                  <description>8 additional wait-states are added</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz54</name>
                  <description>9 additional wait-states are added</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz55</name>
                  <description>10 additional wait-states are added</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz56</name>
                  <description>11 additional wait-states are added</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz57</name>
                  <description>12 additional wait-states are added</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz58</name>
                  <description>13 additional wait-states are added</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz59</name>
                  <description>14 additional wait-states are added</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz60</name>
                  <description>15 additional wait-states are added</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSACTIVE</name>
              <description>Low Speed Active Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz43</name>
                  <description>Full speed active mode requested</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz44</name>
                  <description>Low speed active mode requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDFD</name>
              <description>Force Double Bit Fault Detect</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz41</name>
                  <description>FSTAT[DFDIF] sets only if a double bit fault is detected during a valid flash read access from the FMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz42</name>
                  <description>FSTAT[DFDIF] sets during any valid flash read access from the FMC; an interrupt request is generated if the DFDIE bit is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABTREQ</name>
              <description>Abort Request</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz39</name>
                  <description>No request to abort a command write sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz40</name>
                  <description>Request to abort a command write sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
