nxp-mcuxpresso/mcux-soc-svd/MCXA133/MCXA133.xml
        <register>
          <name>MCTL</name>
          <description>FMU Control Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x213048FD</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COREHLD</name>
              <description>Core Hold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz125</name>
                  <description>CPU access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz126</name>
                  <description>CPU access must be blocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSACT_EN</name>
              <description>LSACTIVE Feature Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz123</name>
                  <description>LSACTIVE feature disabled completely: FCTRL[LSACTIVE] is forced low and no longer writable, LVE cannot assert at the TSMC array interface.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz124</name>
                  <description>LSACTIVE feature fully enabled and controllable by SoC and internal UINT SM.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSACTWREN</name>
              <description>LSACTIVE Write Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz121</name>
                  <description>Unrestricted write access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz122</name>
                  <description>Write access while CMP set must match CMDDID and CMDPRT</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASTER_REPAIR_EN</name>
              <description>Master Repair Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz119</name>
                  <description>Repair disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz120</name>
                  <description>Repair enable determined by bit 0 of each REPAIR register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFCMDEN</name>
              <description>RF Active Command Enable Control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz117</name>
                  <description>Flash commands blocked (CCIF not writable)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz118</name>
                  <description>Flash commands allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWSABTEN</name>
              <description>Command Write Sequence Abort Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz115</name>
                  <description>CWS abort feature is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz116</name>
                  <description>CWS abort feature is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRGRDDIS</name>
              <description>Margin Read Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz113</name>
                  <description>Margin Read Settings are enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz114</name>
                  <description>Margin Read Settings are disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRGRD0</name>
              <description>Margin Read Setting for Program</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MRGRD1</name>
              <description>Margin Read Setting for Erase</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERSAACK</name>
              <description>Mass Erase (Erase All) Acknowledge</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz111</name>
                  <description>Mass Erase operation is not active (operation has completed or has not started)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz112</name>
                  <description>Mass Erase operation is active (controller acknowledges that the soc_ersall_req input is asserted and will continue with the operation)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCAN_OBS</name>
              <description>Scan Observability Control</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz109</name>
                  <description>Normal functional behavior</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz110</name>
                  <description>Enables observation of signals that may otherwise be ATPG untestable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIST_CTL</name>
              <description>BIST IP Control</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz107</name>
                  <description>BIST IP disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz108</name>
                  <description>BIST IP enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMWR_CTL</name>
              <description>SMWR IP Control</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz105</name>
                  <description>SMWR IP disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz106</name>
                  <description>SMWR IP enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SALV_DIS</name>
              <description>Salvage Disable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz103</name>
                  <description>Salvage enabled (ECC used during erase verify)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz104</name>
                  <description>Salvage disabled (ECC not used during erase verify)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOC_ECC_CTL</name>
              <description>SOC ECC Control</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz101</name>
                  <description>ECC is enabled for SOC read access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz102</name>
                  <description>ECC is disabled for SOC read access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMU_ECC_CTL</name>
              <description>FMU ECC Control</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz99</name>
                  <description>ECC is enabled for FMU program operations</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz100</name>
                  <description>ECC is disabled for FMU program operations</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIST_PWR_DIS</name>
              <description>BIST Power Mode Disable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz97</name>
                  <description>BIST DFT logic has full control of SLM and LVE when BIST is enabled (including during commands)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz98</name>
                  <description>BIST DFT logic has no control of SLM and LVE; power mode RTL is in complete control of SLM and LVE values</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_H</name>
              <description>Oscillator control</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz95</name>
                  <description>Use APB clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz96</name>
                  <description>Use a known fixed-frequency clock, e.g. 12 MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BSEL_GEN</name>
          <description>FMU Block Select Generation Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x301</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SBSEL_GEN</name>
              <description>Generated SBSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MBSEL_GEN</name>
              <description>Generated MBSEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_OPT</name>
          <description>Power Mode Options Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80FA0032</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD_CDIV</name>
              <description>Power Down Clock Divider Setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLM_COUNT</name>
              <description>Sleep Recovery Timer Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_TIMER_EN</name>
              <description>Power Down BIST Timer Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz127</name>
                  <description>BIST timer is not triggered during Power Down recovery</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz128</name>
                  <description>BIST timer is triggered during Power Down recovery (default behavior)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
