nxp-mcuxpresso/mcux-soc-svd/MCXA133/MCXA133.xml
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCEN</name>
              <description>ADC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>ADC is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>ADC is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST</name>
              <description>Software Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RELEASED_FROM_RESET</name>
                  <description>ADC logic is not reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HELD_IN_RESET</name>
                  <description>ADC logic is reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOZEN</name>
              <description>Doze Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>ADC is enabled in low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>ADC is disabled in low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAL_REQ</name>
              <description>Auto-Calibration Request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CALIBRATION_REQUEST</name>
                  <description>No request for hardware calibration has been made</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CALIBRATION_REQUEST_PENDING</name>
                  <description>A request for hardware calibration has been made</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALOFS</name>
              <description>Offset Calibration Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTIVE_OFFSET_CALIBRATION_REQUEST</name>
                  <description>No request for offset calibration has been made</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET_CALIBRATION_REQUEST_PENDING</name>
                  <description>Request for offset calibration function</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALHS</name>
              <description>High Speed Mode Trim Request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTIVE_HS_TRIM_REQUEST</name>
                  <description>No request for high speed mode trim has been made</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HS_TRIM_REQUEST_PENDING</name>
                  <description>Request for high speed mode trim has been made</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTFIFO0</name>
              <description>Reset FIFO 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_RESET</name>
                  <description>FIFO 0 is reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAL_AVGS</name>
              <description>Auto-Calibration Averages</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AVERAGE</name>
                  <description>Single conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_2</name>
                  <description>2 conversions averaged.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_4</name>
                  <description>4 conversions averaged.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_8</name>
                  <description>8 conversions averaged.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_16</name>
                  <description>16 conversions averaged.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_32</name>
                  <description>32 conversions averaged.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_64</name>
                  <description>64 conversions averaged.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_128</name>
                  <description>128 conversions averaged.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_256</name>
                  <description>256 conversions averaged.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_512</name>
                  <description>512 conversions averaged.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_1024</name>
                  <description>1024 conversions averaged.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDY0</name>
              <description>Result FIFO 0 Ready Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BELOW_THRESHOLD</name>
                  <description>Result FIFO 0 data level not above watermark level.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABOVE_THRESHOLD</name>
                  <description>Result FIFO 0 holding data above watermark level.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOF0</name>
              <description>Result FIFO 0 Overflow Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OVERFLOW</name>
                  <description>No result FIFO 0 overflow has occurred since the last time the flag was cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERFLOW_DETECTED</name>
                  <description>At least one result FIFO 0 overflow has occurred since the last time the flag was cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEXC_INT</name>
              <description>Interrupt Flag For High Priority Trigger Exception</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXCEPTION</name>
                  <description>No trigger exceptions have occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXCEPTION_DETECTED</name>
                  <description>A trigger exception has occurred and is pending acknowledgement.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCOMP_INT</name>
              <description>Interrupt Flag For Trigger Completion</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLAG_CLEAR</name>
                  <description>Either IE[TCOMP_IE] is set to 0, or no trigger sequences have run to completion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETION_DETECTED</name>
                  <description>Trigger sequence has been completed and all data is stored in the associated FIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAL_RDY</name>
              <description>Calibration Ready</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SET</name>
                  <description>Calibration is incomplete or hasn't been ran.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDWARE_CAL_STEP_COMPLETED</name>
                  <description>The ADC is calibrated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_ACTIVE</name>
              <description>ADC Active</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ACTIVE</name>
                  <description>The ADC is IDLE. There are no pending triggers to service and no active commands are being processed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>The ADC is processing a conversion, running through the power up delay, or servicing a trigger.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGACT</name>
              <description>Trigger Active</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_0</name>
                  <description>Command (sequence) associated with Trigger 0 currently being executed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_1</name>
                  <description>Command (sequence) associated with Trigger 1 currently being executed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_2</name>
                  <description>Command (sequence) associated with Trigger 2 currently being executed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_3</name>
                  <description>Command (sequence) associated with Trigger 3 currently being executed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDACT</name>
              <description>Command Active</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_COMMAND_ACTIVE</name>
                  <description>No command is currently in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_1</name>
                  <description>Command 1 currently being executed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_2</name>
                  <description>Command 2 currently being executed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_3</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_4</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_5</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_6</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_7</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
